// Задача 10:Напишите программу, которая принимает на вход трёхзначное число и на выходе
// показывает вторую цифру этого числа.
// 456 -> 5
// 782 -> 8
// 918 -> 1

// Console.Write("Введите трехзначное число: ");
//         int number = int.Parse(Console.ReadLine());

        // Вычисление второй цифры числа
        // int secondDigit = (number / 10) % 10;

        // Console.WriteLine($"Вторая цифра: {secondDigit}");



// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6    

//    Console.Write("Введите число: ");
//         int number = int.Parse(Console.ReadLine());

//         int thirdDigit = (number / 100) % 10;

//         if (thirdDigit != 0)
//         {
//             Console.WriteLine($"Третья цифра: {thirdDigit}");
//         }
//         else
//         {
//             Console.WriteLine("Третьей цифры нет");
//         }


// Задача 15:Напишите программу, которая принимает на вход цифру, обозначающую день недели,
// и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет


//  Console.WriteLine("Введите число, обозначающее день недели (от 1 до 7):");
//         int day = Convert.ToInt32(Console.ReadLine());

//         if (day == 6 || day == 7)
//         {
//             Console.WriteLine("Да, это выходной день.");
//         }
//         else
//         {
//             Console.WriteLine("Нет, это не выходной день.");
//         }


   
    








